# SQL

## Getting Data From One Table

In [45]:
%load_ext sql
%sql sqlite:///northwind.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
%%sql
ALTER TABLE Customers RENAME COLUMN CompanyName TO CustomerName;

 * sqlite:///northwind.db
(sqlite3.OperationalError) no such column: "CompanyName"
[SQL: ALTER TABLE Customers RENAME COLUMN CompanyName TO CustomerName;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [77]:
%%sql
--Star means all of them
SELECT * FROM Customers LIMIT 5;

 * sqlite:///northwind.db
Done.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', 'Western Europe', '12209', 'Germany', '030-0074321', '030-0076545'),
 ('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitución 2222', 'México D.F.', 'Central America', '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745'),
 ('ANTON', 'Antonio Moreno Taquería', 'Antonio Moreno', 'Owner', 'Mataderos  2312', 'México D.F.', 'Central America', '05023', 'Mexico', '(5) 555-3932', None),
 ('AROUT', 'Around the Horn', 'Thomas Hardy', 'Sales Representative', '120 Hanover Sq.', 'London', 'British Isles', 'WA1 1DP', 'UK', '(171) 555-7788', '(171) 555-6750'),
 ('BERGS', 'Berglunds snabbköp', 'Christina Berglund', 'Order Administrator', 'Berguvsvägen  8', 'Luleå', 'Northern Europe', 'S-958 22', 'Sweden', '0921-12 34 65', '0921-12 34 67')]

In [48]:
%%sql
SELECT ContactName, Address FROM Customers LIMIT 5;

 * sqlite:///northwind.db
Done.

[('Maria Anders', 'Obere Str. 57'),
 ('Ana Trujillo', 'Avda. de la Constitución 2222'),
 ('Antonio Moreno', 'Mataderos  2312'),
 ('Thomas Hardy', '120 Hanover Sq.'),
 ('Christina Berglund', 'Berguvsvägen  8')]

In [49]:
%%sql
--SQL is not case sensitive
--Because we have different SQLs, maybe we have case sensitive ones to. But in interview they don't care about these
sElect ConTactName, Address FROM CUstomers LIMIT 5;

 * sqlite:///northwind.db
Done.

[('Maria Anders', 'Obere Str. 57'),
 ('Ana Trujillo', 'Avda. de la Constitución 2222'),
 ('Antonio Moreno', 'Mataderos  2312'),
 ('Thomas Hardy', '120 Hanover Sq.'),
 ('Christina Berglund', 'Berguvsvägen  8')]

## Data Types

In [50]:
%%sql
--The [] is not necessary
SELECT * FROM [Orders] LIMIT 5

 * sqlite:///northwind.db
Done.

[(10248, 'VINET', 5, '2016-07-04', '2016-08-01', '2016-07-16', 3, 16.75, 'Vins et alcools Chevalier', '59 rue de l-Abbaye', 'Reims', 'Western Europe', '51100', 'France'),
 (10249, 'TOMSP', 6, '2016-07-05', '2016-08-16', '2016-07-10', 1, 22.25, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', 'Western Europe', '44087', 'Germany'),
 (10250, 'HANAR', 4, '2016-07-08', '2016-08-05', '2016-07-12', 2, 25, 'Hanari Carnes', 'Rua do Paço, 67', 'Rio de Janeiro', 'South America', '05454-876', 'Brazil'),
 (10251, 'VICTE', 3, '2016-07-08', '2016-08-05', '2016-07-15', 1, 20.25, 'Victuailles en stock', '2, rue du Commerce', 'Lyon', 'Western Europe', '69004', 'France'),
 (10252, 'SUPRD', 4, '2016-07-09', '2016-08-06', '2016-07-11', 2, 36.25, 'Suprêmes délices', 'Boulevard Tirou, 255', 'Charleroi', 'Western Europe', 'B-6000', 'Belgium')]

In [51]:
%%sql
SELECT * FROM Products LIMIT 5;

 * sqlite:///northwind.db
Done.

[(1, 'Chai', 1, 1, '10 boxes x 20 bags', 18, 39, 0, 10, '0'),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19, 17, 40, 25, '0'),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10, 13, 70, 25, '0'),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22, 53, 0, 0, '0'),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21.35, 0, 0, 0, '1')]

In [52]:
%%sql
--WHERE is only for rows!
SELECT * FROM Customers WHERE CustomerName = "Alfreds Futterkiste";

 * sqlite:///northwind.db
Done.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', 'Western Europe', '12209', 'Germany', '030-0074321', '030-0076545')]

## Pattern Matching

In [53]:
%%sql
SELECT * FROM Customers WHERE Country = "Germany" LIMIT 5;

 * sqlite:///northwind.db
Done.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', 'Western Europe', '12209', 'Germany', '030-0074321', '030-0076545'),
 ('BLAUS', 'Blauer See Delikatessen', 'Hanna Moos', 'Sales Representative', 'Forsterstr. 57', 'Mannheim', 'Western Europe', '68306', 'Germany', '0621-08460', '0621-08924'),
 ('DRACD', 'Drachenblut Delikatessen', 'Sven Ottlieb', 'Order Administrator', 'Walserweg 21', 'Aachen', 'Western Europe', '52066', 'Germany', '0241-039123', '0241-059428'),
 ('FRANK', 'Frankenversand', 'Peter Franken', 'Marketing Manager', 'Berliner Platz 43', 'München', 'Western Europe', '80805', 'Germany', '089-0877310', '089-0877451'),
 ('KOENE', 'Königlich Essen', 'Philip Cramer', 'Sales Associate', 'Maubelstr. 90', 'Brandenburg', 'Western Europe', '14776', 'Germany', '0555-09876', None)]

In [54]:
%%sql
SELECT * FROM Customers WHERE CustomerName LIKE "Alf";

 * sqlite:///northwind.db
Done.

[]

In [55]:
%%sql
SELECT * FROM Customers WHERE CustomerName LIKE "Alf%";

 * sqlite:///northwind.db
Done.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', 'Western Europe', '12209', 'Germany', '030-0074321', '030-0076545')]

In [56]:
%%sql
SELECT * FROM Customers WHERE CustomerName LIKE "Alf%";

 * sqlite:///northwind.db
Done.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', 'Western Europe', '12209', 'Germany', '030-0074321', '030-0076545')]

In [57]:
%%sql
SELECT * FROM Customers WHERE CustomerName LIKE "A%";

 * sqlite:///northwind.db
Done.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', 'Western Europe', '12209', 'Germany', '030-0074321', '030-0076545'),
 ('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitución 2222', 'México D.F.', 'Central America', '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745'),
 ('ANTON', 'Antonio Moreno Taquería', 'Antonio Moreno', 'Owner', 'Mataderos  2312', 'México D.F.', 'Central America', '05023', 'Mexico', '(5) 555-3932', None),
 ('AROUT', 'Around the Horn', 'Thomas Hardy', 'Sales Representative', '120 Hanover Sq.', 'London', 'British Isles', 'WA1 1DP', 'UK', '(171) 555-7788', '(171) 555-6750')]

In [58]:
%%sql
SELECT * FROM Customers WHERE CustomerName LIKE "a%";

 * sqlite:///northwind.db
Done.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', 'Western Europe', '12209', 'Germany', '030-0074321', '030-0076545'),
 ('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitución 2222', 'México D.F.', 'Central America', '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745'),
 ('ANTON', 'Antonio Moreno Taquería', 'Antonio Moreno', 'Owner', 'Mataderos  2312', 'México D.F.', 'Central America', '05023', 'Mexico', '(5) 555-3932', None),
 ('AROUT', 'Around the Horn', 'Thomas Hardy', 'Sales Representative', '120 Hanover Sq.', 'London', 'British Isles', 'WA1 1DP', 'UK', '(171) 555-7788', '(171) 555-6750')]

In [66]:
%%sql
SELECT * FROM Customers WHERE CustomerName LIKE "%a";

 * sqlite:///northwind.db
Done.

[('ANTON', 'Antonio Moreno Taquería', 'Antonio Moreno', 'Owner', 'Mataderos  2312', 'México D.F.', 'Central America', '05023', 'Mexico', '(5) 555-3932', None),
 ('CENTC', 'Centro comercial Moctezuma', 'Francisco Chang', 'Marketing Manager', 'Sierras de Granada 9993', 'México D.F.', 'Central America', '05022', 'Mexico', '(5) 555-3392', '(5) 555-7293'),
 ('GODOS', 'Godos Cocina Típica', 'José Pedro Freyre', 'Sales Manager', 'C/ Romero, 33', 'Sevilla', 'Southern Europe', '41101', 'Spain', '(95) 555 82 82', None),
 ('QUEDE', 'Que Delícia', 'Bernardo Batista', 'Accounting Manager', 'Rua da Panificadora, 12', 'Rio de Janeiro', 'South America', '02389-673', 'Brazil', '(21) 555-4252', '(21) 555-4545'),
 ('QUEEN', 'Queen Cozinha', 'Lúcia Carvalho', 'Marketing Assistant', 'Alameda dos Canàrios, 891', 'Sao Paulo', 'South America', '05487-020', 'Brazil', '(11) 555-1189', None),
 ('WELLI', 'Wellington Importadora', 'Paula Parente', 'Sales Manager', 'Rua do Mercado, 12', 'Resende', 'South America', '08737-363', 'Brazil', '(14) 555-8122', None),
 ('WILMK', 'Wilman Kala', 'Matti Karttunen', 'Owner/Marketing Assistant', 'Keskuskatu 45', 'Helsinki', 'Scandinavia', '21240', 'Finland', '90-224 8858', '90-224 8858')]

## Dates

In [79]:
%%sql
--You need to write the date pattern here!
SELECT * FROM Orders WHERE OrderDate BETWEEN "2015" AND "2017" LIMIT 5;

 * sqlite:///northwind.db
Done.

[]

In [78]:
%%sql
--2015 is excluded and 2017 is included
SELECT * FROM Orders WHERE OrderDate BETWEEN "2015-xx-xx" AND "2017-xx-xx" LIMIT 5;

 * sqlite:///northwind.db
Done.

[(10248, 'VINET', 5, '2016-07-04', '2016-08-01', '2016-07-16', 3, 16.75, 'Vins et alcools Chevalier', '59 rue de l-Abbaye', 'Reims', 'Western Europe', '51100', 'France'),
 (10249, 'TOMSP', 6, '2016-07-05', '2016-08-16', '2016-07-10', 1, 22.25, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', 'Western Europe', '44087', 'Germany'),
 (10250, 'HANAR', 4, '2016-07-08', '2016-08-05', '2016-07-12', 2, 25, 'Hanari Carnes', 'Rua do Paço, 67', 'Rio de Janeiro', 'South America', '05454-876', 'Brazil'),
 (10251, 'VICTE', 3, '2016-07-08', '2016-08-05', '2016-07-15', 1, 20.25, 'Victuailles en stock', '2, rue du Commerce', 'Lyon', 'Western Europe', '69004', 'France'),
 (10252, 'SUPRD', 4, '2016-07-09', '2016-08-06', '2016-07-11', 2, 36.25, 'Suprêmes délices', 'Boulevard Tirou, 255', 'Charleroi', 'Western Europe', 'B-6000', 'Belgium')]

## Numbers

In [81]:
%%sql
ALTER TABLE Products RENAME COLUMN UnitPrice TO Price;

 * sqlite:///northwind.db
Done.

[]

In [83]:
%%sql
SELECT Price FROM PRODUCTS LIMIT 5;

 * sqlite:///northwind.db
Done.

[(18,), (19,), (10,), (22,), (21.35,)]

### Aggregation
combining multiple rows into a single summary value 💡
very important for data scientist🎯

In [86]:
%%sql 
SELECT AVG(Price) FROM Products;

 * sqlite:///northwind.db
Done.

[(28.866363636363637,)]

In [ ]:
%%sql
--Column
SELECT COUNT(Price) FROM Products;

 * sqlite:///northwind.db
Done.

[(77,)]

In [88]:
%%sql
--Rows
SELECT COUNT(*) FROM Products;

 * sqlite:///northwind.db
Done.

[(77,)]

In [90]:
%%sql
SELECT MIN(Price) FROM Products;

 * sqlite:///northwind.db
Done.

[(2.5,)]

In [ ]:
%%sql
--Aliasing = giving something a temporary nickname 💡
--It's better to named it like this because when we're working with multiple tables we need to know what these things are called
SELECT MIN(Price) AS MinPrice FROM Products;

 * sqlite:///northwind.db
Done.

[(2.5,)]